banco-dados.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2024-07-15 seg 10:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Banco de dados</title>
<meta name="author" content="Jackson de Jesus" />
<meta name="description" content="Resumo dos conceitos de banco de dados" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Banco de dados</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org17182df">Conceitos de Banco de Dados: resumo</a>
<ul>
<li><a href="#orge0e4827">Capítulo 1</a></li>
<li><a href="#org315111f">Capítulo 2</a></li>
<li><a href="#org4e2b8e6">Capítulo 3</a></li>
<li><a href="#orge763831">Capítulo 4</a></li>
<li><a href="#org05c1299">Capítulo 5</a></li>
<li><a href="#org0c6063c">Capítulo 6</a></li>
<li><a href="#org62b73f5">Como organizei o conteúdo desta página</a></li>
</ul>
</li>
<li><a href="#orge246783">Voltar para o início&#x2026;</a></li>
</ul>
</div>
</div>

<div id="outline-container-org17182df" class="outline-2">
<h2 id="org17182df">Conceitos de Banco de Dados: resumo</h2>
<div class="outline-text-2" id="text-org17182df">
</div>
<div id="outline-container-orge0e4827" class="outline-3">
<h3 id="orge0e4827">Capítulo 1</h3>
<div class="outline-text-3" id="text-orge0e4827">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Dado</b></b></td>
<td class="org-left">Fatos brutos e isolados que representam uma informação básica.</td>
</tr>

<tr>
<td class="org-left"><b><b>Informação</b></b></td>
<td class="org-left">Conjunto de dados organizados e processados que adquirem significado e se tornam úteis para a tomada de decisões.</td>
</tr>

<tr>
<td class="org-left"><b><b>Banco de Dados (BD)</b></b></td>
<td class="org-left">Local onde os dados de uma aplicação são armazenados de forma estruturada.</td>
</tr>

<tr>
<td class="org-left"><b><b>Sistema Gerenciador de Banco de Dados (SGBD)</b></b></td>
<td class="org-left">Software que permite aos usuários interagir com os dados armazenados no banco de dados, fornecendo ferramentas para acessar, manipular e gerenciar as informações.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelagem de Dados</b></b></td>
<td class="org-left">Processo de representação visual e conceitual da estrutura de um banco de dados, mostrando as entidades, seus atributos e as relações entre elas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelo Conceitual</b></b></td>
<td class="org-left">Representação abstrata e de alto nível de um banco de dados, focando nas entidades, seus atributos e as relações entre elas, independente da implementação física ou do SGBD utilizado.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelo Lógico</b></b></td>
<td class="org-left">Descreve o banco de dados no nível do SGBD escolhido, definindo as tabelas, colunas, tipos de dados e restrições de integridade, considerando as características específicas do SGBD.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelo Físico</b></b></td>
<td class="org-left">Detalha como o banco de dados será implementado fisicamente no sistema de armazenamento, definindo a organização dos arquivos, índices, tamanho dos campos e outros aspectos físicos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Entidade</b></b></td>
<td class="org-left">Representação abstrata de um objeto do mundo real sobre o qual queremos armazenar informações em um banco de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Campo (Atributo)</b></b></td>
<td class="org-left">Característica específica de uma entidade, armazenando um tipo específico de dado, como nome, data de nascimento, endereço, etc.</td>
</tr>

<tr>
<td class="org-left"><b><b>Relacionamento</b></b></td>
<td class="org-left">Associação entre duas ou mais entidades, representando como elas se conectam e interagem no modelo de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Chave Primária (PK)</b></b></td>
<td class="org-left">Campo ou conjunto de campos que identifica unicamente cada instância de uma entidade.</td>
</tr>

<tr>
<td class="org-left"><b><b>Chave Estrangeira (FK)</b></b></td>
<td class="org-left">Campo em uma tabela que se relaciona com a chave primária de outra tabela, estabelecendo um link entre as entidades.</td>
</tr>

<tr>
<td class="org-left"><b><b>Cardinalidade</b></b></td>
<td class="org-left">Define a quantidade de instâncias de uma entidade que podem estar relacionadas a instâncias de outra entidade em um relacionamento.</td>
</tr>

<tr>
<td class="org-left"><b><b>Entidade Associativa</b></b></td>
<td class="org-left">Criada para representar um relacionamento muitos-para-muitos (N:N) entre duas entidades, contendo as chaves estrangeiras de ambas as entidades.</td>
</tr>
</tbody>
</table>
</div>
</div>
