banco-dados.html

<div id="outline-container-org315111f" class="outline-3">
<h3 id="org315111f">Capítulo 2</h3>
<div class="outline-text-3" id="text-org315111f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Modelo Relacional</b></b></td>
<td class="org-left">Modelo de dados adequado para um SGBD específico, baseado no princípio de que todos os dados estão armazenados em tabelas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Tupla</b></b></td>
<td class="org-left">Conjunto horizontal de dados presentes nos atributos, similar a um registro ou linha em uma tabela.</td>
</tr>

<tr>
<td class="org-left"><b><b>Atributo</b></b></td>
<td class="org-left">Nome que identifica o dado armazenado em um banco de dados, equivalente a uma coluna em uma tabela.</td>
</tr>

<tr>
<td class="org-left"><b><b>Domínio</b></b></td>
<td class="org-left">Tipo de dado (inteiro, caractere, decimal, data, etc.) que define o tamanho, os valores permitidos e os padrões de validação para um atributo.</td>
</tr>

<tr>
<td class="org-left"><b><b>Relação</b></b></td>
<td class="org-left">Conjunto de tuplas que formam uma tabela, representando um objeto específico dentro do banco de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Álgebra Relacional</b></b></td>
<td class="org-left">Linguagem formal de consulta que permite manipular relações (tabelas) através de operadores, como seleção, projeção e junção, para obter um resultado desejado.</td>
</tr>

<tr>
<td class="org-left"><b><b>Operador de Seleção (Where)</b></b></td>
<td class="org-left">Seleciona um subconjunto de tuplas de uma relação com base em uma condição pré-estabelecida, similar à aplicação de um filtro em uma tabela.</td>
</tr>

<tr>
<td class="org-left"><b><b>Operador de Projeção (Select)</b></b></td>
<td class="org-left">Retorna apenas colunas específicas de uma relação, similar a escolher quais colunas exibir em uma tabela.</td>
</tr>

<tr>
<td class="org-left"><b><b>Restrições de Integridade</b></b></td>
<td class="org-left">Regras aplicadas a um banco de dados para garantir a qualidade, consistência e confiabilidade dos dados armazenados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Chave Primária</b></b></td>
<td class="org-left">Atributo ou conjunto de atributos que identifica unicamente cada tupla em uma relação, garantindo que não haja registros duplicados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Chave Estrangeira</b></b></td>
<td class="org-left">Atributo em uma tabela que se relaciona à chave primária de outra tabela, estabelecendo um link entre as entidades e garantindo a integridade referencial.</td>
</tr>

<tr>
<td class="org-left"><b><b>Chave Composta</b></b></td>
<td class="org-left">Chave primária formada por dois ou mais atributos, geralmente utilizada em entidades associativas que representam relacionamentos muitos-para-muitos (N:N).</td>
</tr>

<tr>
<td class="org-left"><b><b>Normalização</b></b></td>
<td class="org-left">Processo de organização das relações (tabelas) em um banco de dados para reduzir a redundância de dados e melhorar a integridade dos dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Formas Normais (FN)</b></b></td>
<td class="org-left">Conjunto de regras e restrições que orientam o processo de normalização, sendo as três primeiras (1FN, 2FN, 3FN) as mais utilizadas na prática.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelo Físico</b></b></td>
<td class="org-left">Fase final do projeto de banco de dados, onde o modelo lógico é adaptado para um SGBD específico, definindo a organização física dos dados em disco, os tipos de dados, índices e outros aspectos de armazenamento.</td>
</tr>

<tr>
<td class="org-left"><b><b>Schema</b></b></td>
<td class="org-left">Agrupamento lógico de objetos (tabelas, índices, etc.) em um banco de dados, geralmente relacionado a uma área de negócio específica.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelagem Dimensional</b></b></td>
<td class="org-left">Técnica de modelagem utilizada principalmente em Data Warehouses e Data Marts para otimizar a análise de grandes volumes de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Tabela Dimensão</b></b></td>
<td class="org-left">Tabela que descreve e classifica os fatos (medidas) em uma modelagem dimensional, contendo atributos descritivos, como nome do produto, data da venda, etc.</td>
</tr>

<tr>
<td class="org-left"><b><b>Tabela Fato</b></b></td>
<td class="org-left">Tabela que armazena as medidas (fatos) de negócio em uma modelagem dimensional, geralmente com dados numéricos e aditivos, como quantidade vendida, valor total da venda, etc.</td>
</tr>

<tr>
<td class="org-left"><b><b>SQL (Structured Query Language)</b></b></td>
<td class="org-left">Linguagem padrão utilizada para comunicação com bancos de dados relacionais, permitindo criar, consultar, manipular e controlar o acesso aos dados.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4e2b8e6" class="outline-3">
<h3 id="org4e2b8e6">Capítulo 3</h3>
<div class="outline-text-3" id="text-org4e2b8e6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Tipo de Dado</td>
<td class="org-left">Define o padrão de informação que um objeto pode armazenar, como colunas em tabelas, parâmetros em procedimentos, variáveis e funções.</td>
</tr>

<tr>
<td class="org-left">Tipo Numérico</td>
<td class="org-left">Armazenam valores inteiros, de ponto flutuante (sem limite na precisão e escala) ou de ponto fixo (com limite na precisão e escala). Exemplos: `bit`, `tinyint`, `int`, `float`, `decimal`.</td>
</tr>

<tr>
<td class="org-left">Tipo Cadeia de Caracteres (String)</td>
<td class="org-left">Podem ser valores binários (`binary`, `varbinary`, `blob`) ou não binários (`char`, `varchar`, `text`). O tipo `varchar` é mais econômico pois só ocupa o espaço realmente utilizado.</td>
</tr>

<tr>
<td class="org-left">Tipo Valor Temporal</td>
<td class="org-left">Armazenam dados de data e hora. Exemplos: `date`, `time`, `datetime`, `timestamp`, `year`.</td>
</tr>

<tr>
<td class="org-left">Chave Primária (PK)</td>
<td class="org-left">Identificador único de uma linha em uma tabela. Não pode conter valores nulos.</td>
</tr>

<tr>
<td class="org-left">Chave Estrangeira (FK)</td>
<td class="org-left">Faz referência à chave primária de outra tabela, estabelecendo um relacionamento entre elas.</td>
</tr>

<tr>
<td class="org-left">Chave Única (UK)</td>
<td class="org-left">Garante a exclusividade de uma coluna em uma tabela, similar à chave primária, mas permitindo múltiplas declarações por tabela.</td>
</tr>

<tr>
<td class="org-left">Chave Composta</td>
<td class="org-left">Uma chave primária formada por múltiplas colunas.</td>
</tr>

<tr>
<td class="org-left">Restrição</td>
<td class="org-left">Regra que garante a integridade dos dados em um banco de dados. Pode ser aplicada em nível de coluna ou de tabela.</td>
</tr>

<tr>
<td class="org-left">Not Null</td>
<td class="org-left">Impede que uma coluna aceite valores nulos.</td>
</tr>

<tr>
<td class="org-left">Check</td>
<td class="org-left">Define regras específicas para os valores de uma coluna. No MySQL, essa restrição é ignorada.</td>
</tr>

<tr>
<td class="org-left">Default</td>
<td class="org-left">Define um valor padrão para uma coluna caso nenhum valor seja informado.</td>
</tr>

<tr>
<td class="org-left">Autoincrement</td>
<td class="org-left">Gera automaticamente um número inteiro sequencial e incremental para uma coluna, geralmente utilizado em chaves primárias.</td>
</tr>

<tr>
<td class="org-left">Unsigned</td>
<td class="org-left">Impede que uma coluna do tipo inteiro aceite valores negativos.</td>
</tr>

<tr>
<td class="org-left">Zerofill</td>
<td class="org-left">Preenche automaticamente com zeros os espaços não utilizados em uma coluna numérica.</td>
</tr>

<tr>
<td class="org-left">Comandos SQL</td>
<td class="org-left">Instruções utilizadas para interagir com o banco de dados. O texto aborda comandos como: `create database`, `create table`, `insert`, `select`, `drop`, `alter table`.</td>
</tr>
</tbody>
</table>
</div>
</div>
