banco-dados.html

<div id="outline-container-orge763831" class="outline-3">
<h3 id="orge763831">Capítulo 4</h3>
<div class="outline-text-3" id="text-orge763831">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">DML (Data Manipulation Language)</td>
<td class="org-left">Linguagem utilizada para manipular os dados armazenados em um banco de dados, incluindo operações de inclusão, modificação, exclusão e consulta de dados.</td>
</tr>

<tr>
<td class="org-left">INSERT</td>
<td class="org-left">Comando SQL utilizado para inserir novos registros em uma tabela.</td>
</tr>

<tr>
<td class="org-left">Sintaxe Simplificada do INSERT</td>
<td class="org-left">Permite inserir valores em todas as colunas da tabela, seguindo a ordem de declaração das mesmas, sem a necessidade de especificar os nomes das colunas. No entanto, essa sintaxe não pode ser utilizada em tabelas com colunas que possuem a cláusula `auto<sub>increment</sub>`.</td>
</tr>

<tr>
<td class="org-left">INSERT com Colunas Específicas</td>
<td class="org-left">Permite inserir dados em colunas específicas de uma tabela. É necessário especificar os nomes das colunas que receberão os valores.</td>
</tr>

<tr>
<td class="org-left">Chave Estrangeira (FK) em INSERT</td>
<td class="org-left">Ao inserir dados em uma tabela com chave estrangeira, o valor referenciado pela FK deve existir na tabela de origem (tabela "pai").</td>
</tr>

<tr>
<td class="org-left">Subquery em INSERT</td>
<td class="org-left">Permite utilizar um comando `SELECT` aninhado (subquery) para inserir dados na tabela, tornando a operação mais dinâmica e otimizada.</td>
</tr>

<tr>
<td class="org-left">DELETE</td>
<td class="org-left">Comando SQL utilizado para excluir registros de uma tabela.</td>
</tr>

<tr>
<td class="org-left">Cláusula WHERE em DELETE</td>
<td class="org-left">Essencial para filtrar as linhas que serão excluídas, evitando a exclusão acidental de todos os registros da tabela.</td>
</tr>

<tr>
<td class="org-left">Subquery em DELETE</td>
<td class="org-left">Assim como no `INSERT`, o `DELETE` permite o uso de subqueries para tornar o processo de exclusão mais otimizado.</td>
</tr>

<tr>
<td class="org-left">TRUNCATE</td>
<td class="org-left">Comando similar ao `DELETE` que remove todos os registros de uma tabela. É mais rápido que o `DELETE`, mas possui limitações, como a impossibilidade de usar triggers, cascade e replicações.</td>
</tr>

<tr>
<td class="org-left">ON DELETE NO ACTION</td>
<td class="org-left">Declaração padrão para chaves estrangeiras que impede a exclusão de registros na tabela "pai" que estejam relacionados com registros na tabela "filha", garantindo a integridade referencial.</td>
</tr>

<tr>
<td class="org-left">ON DELETE CASCADE</td>
<td class="org-left">Declaração para chaves estrangeiras que permite a exclusão em cascata. Ao excluir um registro na tabela "pai", os registros relacionados na tabela "filha" também são excluídos.</td>
</tr>

<tr>
<td class="org-left">UPDATE</td>
<td class="org-left">Comando SQL utilizado para atualizar registros existentes em uma tabela.</td>
</tr>

<tr>
<td class="org-left">Cláusula SET em UPDATE</td>
<td class="org-left">Utilizada para especificar as colunas que serão atualizadas e seus novos valores.</td>
</tr>

<tr>
<td class="org-left">Cláusula WHERE em UPDATE</td>
<td class="org-left">Recomendada para filtrar os registros que serão atualizados, similar ao `DELETE`.</td>
</tr>

<tr>
<td class="org-left">Subquery em UPDATE</td>
<td class="org-left">Permite utilizar um comando `SELECT` aninhado para atualizar dados na tabela.</td>
</tr>

<tr>
<td class="org-left">ON UPDATE NO ACTION</td>
<td class="org-left">Declaração padrão para chaves estrangeiras que impede a atualização de valores na tabela "pai" que estejam sendo utilizados como chave estrangeira na tabela "filha".</td>
</tr>

<tr>
<td class="org-left">ON UPDATE CASCADE</td>
<td class="org-left">Permite a atualização em cascata. Ao atualizar um valor na tabela "pai", os registros relacionados na tabela "filha" também são atualizados.</td>
</tr>

<tr>
<td class="org-left">Operadores Lógicos</td>
<td class="org-left">Utilizados para combinar condições em uma consulta. Os operadores lógicos são `AND`, `OR` e `NOT`.</td>
</tr>

<tr>
<td class="org-left">Operadores Relacionais</td>
<td class="org-left">Utilizados para comparar valores em uma consulta. Exemplos: `=`, `&lt;&gt;`, `&gt;`, `&lt;`, `&gt;=`, `&lt;=`, `IN`, `NOT IN`, `LIKE`, `BETWEEN`, `IS NULL`, `EXISTS`, `ANY`, `ALL`.</td>
</tr>

<tr>
<td class="org-left">Operadores Aritméticos</td>
<td class="org-left">Utilizados para realizar operações matemáticas em uma consulta. Os operadores aritméticos são `+`, `-`, `*` e `/`.</td>
</tr>

<tr>
<td class="org-left">ORDER BY</td>
<td class="org-left">Cláusula utilizada para ordenar os resultados de uma consulta em ordem crescente (`ASC`) ou decrescente (`DESC`).</td>
</tr>

<tr>
<td class="org-left">JOIN</td>
<td class="org-left">Operação que permite combinar dados de múltiplas tabelas em uma única consulta.</td>
</tr>

<tr>
<td class="org-left">Tipos de JOIN</td>
<td class="org-left">Inner Join, Outer Join (Left Join, Right Join, Full Join), Cross Join e Self Join.</td>
</tr>

<tr>
<td class="org-left">ALIAS</td>
<td class="org-left">Recurso que permite renomear tabelas ou colunas em uma consulta, tornando o código mais legível e intuitivo.</td>
</tr>

<tr>
<td class="org-left">LIMIT</td>
<td class="org-left">Cláusula utilizada para limitar o número de linhas retornadas em uma consulta.</td>
</tr>

<tr>
<td class="org-left">DISTINCT</td>
<td class="org-left">Cláusula utilizada para retornar apenas valores únicos em uma consulta, eliminando duplicatas.</td>
</tr>

<tr>
<td class="org-left">CASE</td>
<td class="org-left">Estrutura utilizada para criar condicionais dentro de uma consulta, permitindo executar diferentes ações com base em diferentes condições.</td>
</tr>

<tr>
<td class="org-left">UNION</td>
<td class="org-left">Operador utilizado para combinar o resultado de múltiplas consultas `SELECT` em um único conjunto de resultados.</td>
</tr>

<tr>
<td class="org-left">UNION ALL</td>
<td class="org-left">Similar ao `UNION`, mas inclui todas as linhas, incluindo duplicatas.</td>
</tr>
</tbody>
</table>
</div>
</div>
