banco-dados.org
** Capítulo 5

| Conceito | Descrição |
|---|---|
| Subqueries | Linhas de comando `select` aninhadas dentro de outros comandos SQL (como `select`, `insert`, `update` ou `delete`), que otimizam consultas e permitem a execução de operações complexas. |
| Operadores Relacionais em Subqueries | Utilizados em conjunto com subqueries para comparar valores retornados pela subquery com a consulta principal. Exemplos: `=`, `>`, `<`, `>=`, `<=`. |
| Operador `IN` | Verifica se um valor presente em uma coluna corresponde a um dos valores retornados por uma subquery ou lista. |
| Operador `EXISTS` | Testa a existência de resultados em uma subquery, retornando verdadeiro (true) se houver pelo menos uma linha resultante, caso contrário, retorna falso (false). |
| Operador `ANY` | Recupera registros da consulta principal que satisfaçam a condição de comparação com qualquer um dos registros retornados pela subquery. |
| Operador `ALL` | Recupera apenas os registros da consulta principal que satisfaçam a condição de comparação com todos os registros retornados pela subquery. |
| Subquery Correlacionada | Subquery que depende da consulta externa para cada linha avaliada, usando um alias da tabela externa na sua própria cláusula `WHERE`. |
| Funções de Formatação de Dados Textuais | Funções do MySQL que manipulam dados do tipo texto, incluindo conversão de maiúsculas e minúsculas, remoção de espaços em branco e extração de partes de strings. Exemplos: `length()`, `upper()`, `lower()`, `trim()`, `substring()`, `replace()`. |
| Funções de Formatação de Dados Numéricos e Temporais | Funções do MySQL que manipulam dados numéricos, de data e hora, como arredondamento, truncamento, extração de partes de datas e cálculos com datas. Exemplos: `round()`, `truncate()`, `curdate()`, `now()`, `date()`, `day()`, `month()`, `year()`, `adddate()`, `datediff()`. |
| Funções de Agregação/Extração de Dados | Funções que sumarizam informações de um conjunto de linhas, como contagem, soma, média, valor mínimo e valor máximo. Exemplos: `count()`, `sum()`, `min()`, `max()`, `avg()`. |
| Cláusula `GROUP BY` | Agrupa linhas com valores idênticos em uma ou mais colunas, permitindo a aplicação de funções de agregação nos grupos formados. |
| Cláusula `HAVING` | Filtra os resultados de uma consulta que usa `GROUP BY`, aplicando condições aos grupos formados. |
| Segurança de Dados | Conjunto de mecanismos que visam prevenir acessos não autorizados aos dados, garantindo a confidencialidade e protegendo informações sensíveis. |
| Segurança Lógica | Controle de acesso a nível de usuário e permissões, definindo quem pode realizar quais operações no banco de dados. |
| Segurança Física | Medidas que protegem o hardware e a infraestrutura do banco de dados contra danos físicos, como falhas de energia ou desastres naturais. |
| Integridade de Dados | Conjunto de regras que garantem a precisão, consistência e validade dos dados armazenados no banco de dados. |
| Integridade Declarativa | Implementada através de restrições definidas na estrutura do banco de dados, como chaves primárias, chaves estrangeiras e tipos de dados. |
| Integridade Procedural | Implementada através de código, como triggers, stored procedures e funções, que validam dados e garantem a integridade em situações mais complexas. |

** Capítulo 6

| Conceito | Descrição |
|---|---|
| **Índices** |  Estruturas que aceleram a busca e recuperação de linhas em tabelas, otimizando consultas. |
| **Tipos de Índices** | * **Clustered:** organiza a tabela pela coluna indexada (ex: chave primária). Só pode haver um por tabela. <br> * **Non-clustered:** ponteiros para os dados, não os reorganiza (ex: chave estrangeira).  |
| **Visão (View)** | Retorna dados de uma consulta salva, simplificando acesso e aumentando segurança. |
| **Transações** | Conjunto de operações como bloco único, garantindo integridade via "tudo ou nada" - sucesso total ou rollback. |
| **Propriedades ACID** | Atomicidade, Consistência, Isolamento, Durabilidade - garantem confiabilidade e integridade. |
| **Problemas de Concorrência** | Leitura suja, não repetida, fantasma, atualização perdida - surgem em acessos simultâneos. |
| **Níveis de Isolamento** | Read uncommitted, committed, repeatable read, serializable - definem a proteção contra problemas de concorrência. |
| **Triggers** |  Ações disparadas por eventos em tabelas (inserção, atualização, exclusão), antes ou depois. |
| **Stored Procedures** |  Blocos de código SQL reutilizáveis, executados pelo SGBD, para tarefas repetitivas, melhorando segurança e consistência. |
| **Functions** |  Como procedures, mas retornam valor(es), úteis para tarefas específicas, usáveis em outros comandos SQL. |
| **Cursores** | Permitem percorrer linha a linha o resultado de um SELECT, útil para operações em registros individuais. |

** Como organizei o conteúdo desta página

Esta página contém resumos dos principais conceitos de banco de dados extraídos de arquivos no formato PDF com a ferramenta [[https://notebooklm.google.com][NotebookLM]].

De forma simples, enviei os arquivos para o NotebookLM e pedi os resumos com os seguintes comandos:

*Organize uma tabela com os principais conceitos do texto. Na primeira coluna, o nome do conceito e na segunda, o conceito em si.*

A partir do segundo pedido, usei o comando:

*Repita o processo anterior para este texto.*

No terceiro pedido, recebi a mensage de:

*O comando fornecido solicita que o processo anterior seja repetido. No entanto, não há processo anterior no histórico de conversas fornecido. [Me] Para obter uma resposta abrangente, forneça o processo anterior que você gostaria que fosse repetido.*

Desta forma, alternei entre o primeiro e segundo comando até o último arquivo, que veio com a formatação Markdown deformada. Então, pedi uma última revisão com o comando:

*Refaça a tabela para uma melhor formatação em Markdown.*

A publicação final continua uma exportação simples, do formato org mode para HTML, usando o Emacs.

* [[./index.html][Voltar para o início...]]
