banco-dados.html

<div id="outline-container-org05c1299" class="outline-3">
<h3 id="org05c1299">Capítulo 5</h3>
<div class="outline-text-3" id="text-org05c1299">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Subqueries</td>
<td class="org-left">Linhas de comando `select` aninhadas dentro de outros comandos SQL (como `select`, `insert`, `update` ou `delete`), que otimizam consultas e permitem a execução de operações complexas.</td>
</tr>

<tr>
<td class="org-left">Operadores Relacionais em Subqueries</td>
<td class="org-left">Utilizados em conjunto com subqueries para comparar valores retornados pela subquery com a consulta principal. Exemplos: `=`, `&gt;`, `&lt;`, `&gt;=`, `&lt;=`.</td>
</tr>

<tr>
<td class="org-left">Operador `IN`</td>
<td class="org-left">Verifica se um valor presente em uma coluna corresponde a um dos valores retornados por uma subquery ou lista.</td>
</tr>

<tr>
<td class="org-left">Operador `EXISTS`</td>
<td class="org-left">Testa a existência de resultados em uma subquery, retornando verdadeiro (true) se houver pelo menos uma linha resultante, caso contrário, retorna falso (false).</td>
</tr>

<tr>
<td class="org-left">Operador `ANY`</td>
<td class="org-left">Recupera registros da consulta principal que satisfaçam a condição de comparação com qualquer um dos registros retornados pela subquery.</td>
</tr>

<tr>
<td class="org-left">Operador `ALL`</td>
<td class="org-left">Recupera apenas os registros da consulta principal que satisfaçam a condição de comparação com todos os registros retornados pela subquery.</td>
</tr>

<tr>
<td class="org-left">Subquery Correlacionada</td>
<td class="org-left">Subquery que depende da consulta externa para cada linha avaliada, usando um alias da tabela externa na sua própria cláusula `WHERE`.</td>
</tr>

<tr>
<td class="org-left">Funções de Formatação de Dados Textuais</td>
<td class="org-left">Funções do MySQL que manipulam dados do tipo texto, incluindo conversão de maiúsculas e minúsculas, remoção de espaços em branco e extração de partes de strings. Exemplos: `length()`, `upper()`, `lower()`, `trim()`, `substring()`, `replace()`.</td>
</tr>

<tr>
<td class="org-left">Funções de Formatação de Dados Numéricos e Temporais</td>
<td class="org-left">Funções do MySQL que manipulam dados numéricos, de data e hora, como arredondamento, truncamento, extração de partes de datas e cálculos com datas. Exemplos: `round()`, `truncate()`, `curdate()`, `now()`, `date()`, `day()`, `month()`, `year()`, `adddate()`, `datediff()`.</td>
</tr>

<tr>
<td class="org-left">Funções de Agregação/Extração de Dados</td>
<td class="org-left">Funções que sumarizam informações de um conjunto de linhas, como contagem, soma, média, valor mínimo e valor máximo. Exemplos: `count()`, `sum()`, `min()`, `max()`, `avg()`.</td>
</tr>

<tr>
<td class="org-left">Cláusula `GROUP BY`</td>
<td class="org-left">Agrupa linhas com valores idênticos em uma ou mais colunas, permitindo a aplicação de funções de agregação nos grupos formados.</td>
</tr>

<tr>
<td class="org-left">Cláusula `HAVING`</td>
<td class="org-left">Filtra os resultados de uma consulta que usa `GROUP BY`, aplicando condições aos grupos formados.</td>
</tr>

<tr>
<td class="org-left">Segurança de Dados</td>
<td class="org-left">Conjunto de mecanismos que visam prevenir acessos não autorizados aos dados, garantindo a confidencialidade e protegendo informações sensíveis.</td>
</tr>

<tr>
<td class="org-left">Segurança Lógica</td>
<td class="org-left">Controle de acesso a nível de usuário e permissões, definindo quem pode realizar quais operações no banco de dados.</td>
</tr>

<tr>
<td class="org-left">Segurança Física</td>
<td class="org-left">Medidas que protegem o hardware e a infraestrutura do banco de dados contra danos físicos, como falhas de energia ou desastres naturais.</td>
</tr>

<tr>
<td class="org-left">Integridade de Dados</td>
<td class="org-left">Conjunto de regras que garantem a precisão, consistência e validade dos dados armazenados no banco de dados.</td>
</tr>

<tr>
<td class="org-left">Integridade Declarativa</td>
<td class="org-left">Implementada através de restrições definidas na estrutura do banco de dados, como chaves primárias, chaves estrangeiras e tipos de dados.</td>
</tr>

<tr>
<td class="org-left">Integridade Procedural</td>
<td class="org-left">Implementada através de código, como triggers, stored procedures e funções, que validam dados e garantem a integridade em situações mais complexas.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0c6063c" class="outline-3">
<h3 id="org0c6063c">Capítulo 6</h3>
<div class="outline-text-3" id="text-org0c6063c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Índices</b></b></td>
<td class="org-left">Estruturas que aceleram a busca e recuperação de linhas em tabelas, otimizando consultas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Tipos de Índices</b></b></td>
<td class="org-left">* <b><b>Clustered:</b></b> organiza a tabela pela coluna indexada (ex: chave primária). Só pode haver um por tabela. &lt;br&gt; * <b><b>Non-clustered:</b></b> ponteiros para os dados, não os reorganiza (ex: chave estrangeira).</td>
</tr>

<tr>
<td class="org-left"><b><b>Visão (View)</b></b></td>
<td class="org-left">Retorna dados de uma consulta salva, simplificando acesso e aumentando segurança.</td>
</tr>

<tr>
<td class="org-left"><b><b>Transações</b></b></td>
<td class="org-left">Conjunto de operações como bloco único, garantindo integridade via "tudo ou nada" - sucesso total ou rollback.</td>
</tr>

<tr>
<td class="org-left"><b><b>Propriedades ACID</b></b></td>
<td class="org-left">Atomicidade, Consistência, Isolamento, Durabilidade - garantem confiabilidade e integridade.</td>
</tr>

<tr>
<td class="org-left"><b><b>Problemas de Concorrência</b></b></td>
<td class="org-left">Leitura suja, não repetida, fantasma, atualização perdida - surgem em acessos simultâneos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Níveis de Isolamento</b></b></td>
<td class="org-left">Read uncommitted, committed, repeatable read, serializable - definem a proteção contra problemas de concorrência.</td>
</tr>

<tr>
<td class="org-left"><b><b>Triggers</b></b></td>
<td class="org-left">Ações disparadas por eventos em tabelas (inserção, atualização, exclusão), antes ou depois.</td>
</tr>

<tr>
<td class="org-left"><b><b>Stored Procedures</b></b></td>
<td class="org-left">Blocos de código SQL reutilizáveis, executados pelo SGBD, para tarefas repetitivas, melhorando segurança e consistência.</td>
</tr>

<tr>
<td class="org-left"><b><b>Functions</b></b></td>
<td class="org-left">Como procedures, mas retornam valor(es), úteis para tarefas específicas, usáveis em outros comandos SQL.</td>
</tr>

<tr>
<td class="org-left"><b><b>Cursores</b></b></td>
<td class="org-left">Permitem percorrer linha a linha o resultado de um SELECT, útil para operações em registros individuais.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org62b73f5" class="outline-3">
<h3 id="org62b73f5">Como organizei o conteúdo desta página</h3>
<div class="outline-text-3" id="text-org62b73f5">
<p>
Esta página contém resumos dos principais conceitos de banco de dados extraídos de arquivos no formato PDF com a ferramenta <a href="https://notebooklm.google.com">NotebookLM</a>.
</p>

<p>
De forma simples, enviei os arquivos para o NotebookLM e pedi os resumos com os seguintes comandos:
</p>

<p>
<b>Organize uma tabela com os principais conceitos do texto. Na primeira coluna, o nome do conceito e na segunda, o conceito em si.</b>
</p>

<p>
A partir do segundo pedido, usei o comando:
</p>

<p>
<b>Repita o processo anterior para este texto.</b>
</p>

<p>
No terceiro pedido, recebi a mensage de:
</p>

<p>
<b>O comando fornecido solicita que o processo anterior seja repetido. No entanto, não há processo anterior no histórico de conversas fornecido. [Me] Para obter uma resposta abrangente, forneça o processo anterior que você gostaria que fosse repetido.</b>
</p>

<p>
Desta forma, alternei entre o primeiro e segundo comando até o último arquivo, que veio com a formatação Markdown deformada. Então, pedi uma última revisão com o comando:
</p>

<p>
<b>Refaça a tabela para uma melhor formatação em Markdown.</b>
</p>

<p>
A publicação final continua uma exportação simples, do formato org mode para HTML, usando o Emacs.
</p>
</div>
</div>
</div>

<div id="outline-container-orge246783" class="outline-2">
<h2 id="orge246783"><a href="./index.html">Voltar para o início&#x2026;</a></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jackson de Jesus</p>
<p class="date">Created: 2024-07-15 seg 10:21</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
